<?php
use frontend\assets\AppAsset;
AppAsset::register($this);
?>
<?php $this->beginPage(); ?>
<!DOCTYPE html>
<html lang="en">
<head>
	<!-- Meta -->
	<meta charset="utf-8">
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=no">
	<meta name="description" content="">
	<meta name="author" content="">
	<meta name="keywords" content="MediaCenter, Template, eCommerce">
	<meta name="robots" content="all">

	<title>蓝猫商城</title>
	<?php $this->head(); ?>
    
	<link href='http://fonts.googleapis.com/css?family=Open+Sans:300,400,600,700,800' rel='stylesheet' type='text/css'>
    <link rel="stylesheet" href="/assets/css/font-awesome.min.css">
    <link rel="shortcut icon" href="/assets/images/favicon.ico">

    <!-- Icons/Glyphs -->
	<!-- HTML5 elements and media queries Support for IE8 : HTML5 shim and Respond.js -->
	<!--[if lt IE 9]>
	<script src="/assets/js/html5shiv.js"></script>
	<script src="/assets/js/respond.min.js"></script>
	<![endif]-->
	
	<!--<script type="text/javascript" src="https://cdn.bootcss.com/jquery/3.2.1/jquery.min.js"></script>-->

</head>
<body>
<?php $this->beginBody(); ?>
<div class="wrapper">

	<!-- ============================================================= TOP NAVIGATION ============================================================= -->
	<nav class="top-bar animate-dropdown">

		<div class="container">
			<div class="col-xs-12 col-sm-6 no-margin">
				<ul>
					<li><a href="<?php echo yii\helpers\Url::to(['index/index'])?>">首页</a></li>
				
				</ul>
			</div><!-- /.col -->

			<div class="col-xs-12 col-sm-6 no-margin">
				<ul class="right">

					<? if (\Yii::$app->user->isGuest): ?>
					<li><a href="<?php echo yii\helpers\Url::to(['member/auth'])?>">注册</a></li>
					<li><a href="<?php echo yii\helpers\Url::to(['member/auth'])?>">登录</a></li>
					<? endif; ?>
                    <? if (!\Yii::$app->user->isGuest): ?>
                   欢迎回来:  <? echo \Yii::$app->user->identity->username ?>
                    <img style="border-radius: 100%; width:30px; height:30px" src="<? echo \Yii::$app->user->identity->img ?>">
                    <? endif; ?>
					<? if (!\Yii::$app->user->isGuest): ?>
                        <li><a href="<?php echo yii\helpers\Url::to(['member/edit'])?>">修改信息</a></li>
                    <li><a href="<?php echo yii\helpers\Url::to(['member/logout'])?>">退出</a></li>
                    <? endif; ?>
				</ul>
			</div><!-- /.col -->
		</div><!-- /.container -->
	</nav><!-- /.top-bar -->
	<!-- ============================================================= TOP NAVIGATION : END ============================================================= -->		<!-- ============================================================= HEADER ============================================================= -->
	<?
	use yii\bootstrap\Alert;
	if (Yii::$app->session->hasFlash('error')){
		Alert::begin([
			'options' => [
				'class' => 'alert-warning',
			],
		]);
		echo \Yii::$app->session->getFlash("error");
		Alert::end();
	}
	?>

    <!-- /.top-bar -->
    <!-- ============================================================= TOP NAVIGATION : END ============================================================= -->		<!-- ============================================================= HEADER ============================================================= -->
    <header>

        <div class="container no-padding">

            <div class="col-xs-12 col-sm-12 col-md-3 logo-holder">
                <!-- ============================================================= LOGO ============================================================= -->
                <div class="logo">
                    <a href="index.html">
                        <!--<img alt="logo" src="assets/images/logo.svg" width="233" height="54"/>-->
                        <svg version="1.0" xmlns="http://www.w3.org/2000/svg"
                             width="120.000000pt" height="60.000000pt" viewBox="0 0 289.000000 121.000000"
                             preserveAspectRatio="xMidYMid meet">
                            <metadata>
                                Created by potrace 1.13, written by Peter Selinger 2001-2015
                            </metadata>
                            <g transform="translate(0.000000,121.000000) scale(0.100000,-0.100000)"
                               fill="#000000" stroke="none">
                                <path class="logo-svg" d="M183 1083 c-14 -21 -19 -53 -22 -147 -3 -107 -6 -124 -28 -157 -48
-73 -66 -188 -43 -269 16 -55 61 -112 120 -152 66 -44 113 -59 205 -67 l70 -6
5 -50 5 -50 18 53 c16 46 22 52 47 52 24 0 29 -5 40 -45 18 -66 30 -65 30 3 0
57 1 60 28 67 46 11 134 58 193 102 79 59 136 127 173 203 55 117 38 258 -41
332 -17 16 -23 32 -23 63 0 44 -22 85 -46 85 -8 0 -26 -12 -40 -27 -24 -25
-26 -26 -75 -15 -115 27 -280 9 -390 -42 -61 -28 -69 -26 -122 33 -32 35 -66
61 -81 61 -3 0 -14 -12 -23 -27z m112 -208 c0 -47 -2 -85 -5 -85 -25 2 -60 57
-60 95 0 24 39 75 57 75 4 0 8 -38 8 -85z m80 60 c36 -35 35 -96 -1 -124 -38
-30 -42 -27 -31 23 7 30 7 57 0 85 -13 48 -3 52 32 16z m410 8 c-14 -35 -17
-92 -7 -122 13 -38 -1 -41 -35 -9 -32 30 -32 90 2 123 28 29 50 33 40 8z m83
-16 c31 -28 30 -80 -3 -112 -13 -14 -28 -25 -32 -25 -4 0 -8 38 -8 84 0 88 2
90 43 53z m-288 -41 c0 -8 -5 -18 -10 -21 -13 -8 -42 14 -34 26 9 15 44 10 44
-5z m-5 -78 c7 -17 18 -23 43 -23 17 0 32 -3 32 -7 0 -13 -65 -9 -78 4 -9 9
-15 9 -24 0 -13 -13 -78 -17 -78 -4 0 4 15 7 33 7 24 0 35 6 42 23 5 12 12 22
15 22 3 0 10 -10 15 -22z"/>
                                <path class="logo-svg" d="M2138 1023 c-10 -2 -18 -11 -18 -19 0 -11 -17 -14 -80 -14 -73 0 -80
-2 -80 -20 0 -17 7 -20 45 -20 41 0 45 -2 45 -24 0 -20 -4 -23 -37 -22 l-37 1
-23 -139 c-23 -138 -24 -166 -3 -166 15 0 28 35 40 118 14 87 36 89 26 2 l-7
-57 85 0 84 0 9 56 c5 39 13 57 24 59 15 3 15 -4 5 -60 -9 -54 -14 -63 -34
-66 -23 -4 -32 -37 -10 -44 23 -8 67 5 72 21 13 42 46 264 41 270 -7 6 -13 8
-45 10 -18 1 -19 4 -10 21 8 15 21 20 55 20 38 0 45 3 45 20 0 18 -7 20 -80
20 -73 0 -80 2 -80 20 0 20 -2 21 -32 13z m40 -90 c-2 -12 -16 -20 -41 -24
-34 -5 -37 -4 -37 18 0 20 5 23 41 23 33 0 40 -3 37 -17z m-26 -86 c-16 -18
-15 -20 13 -43 l30 -24 -75 0 c-68 1 -73 2 -56 15 11 8 23 15 28 15 10 0 10
21 -1 38 -6 10 -15 9 -44 -8 -37 -22 -37 -22 -37 -2 0 26 10 29 92 28 64 -1
66 -2 50 -19z m83 12 c4 -5 4 -17 1 -25 -5 -13 -9 -13 -31 2 -14 9 -25 19 -25
23 0 11 49 11 55 0z m-85 -123 c0 -24 -17 -36 -51 -36 -32 0 -39 3 -39 20 0
17 7 20 45 20 25 0 45 -2 45 -4z"/>
                                <path class="logo-svg" d="M1268 1009 c-2 -5 -27 -10 -56 -11 -44 0 -52 -3 -52 -19 0 -16 8 -19
50 -19 38 0 50 -4 50 -15 0 -8 9 -15 19 -15 10 0 21 7 25 15 3 10 19 15 46 15
29 0 40 -4 40 -15 0 -9 9 -15 25 -15 16 0 25 6 25 15 0 12 13 15 56 15 47 0
55 3 52 18 -3 13 -13 17 -51 16 -34 -1 -47 2 -47 12 0 18 -36 18 -43 0 -7 -18
-93 -16 -89 2 3 15 -45 16 -50 1z"/>
                                <path class="logo-svg" d="M1756 995 c-5 -20 -13 -25 -36 -25 -23 0 -30 -4 -30 -20 0 -15 7 -20
25 -20 18 0 25 -5 25 -20 0 -14 7 -20 21 -20 12 0 23 8 26 20 4 14 14 20 35
20 25 0 29 -3 25 -20 -4 -16 0 -20 19 -20 17 0 24 6 24 19 0 14 8 21 27 23 38
4 45 38 9 38 -23 0 -26 3 -20 25 5 22 3 25 -20 25 -21 0 -26 -5 -26 -25 0 -21
-5 -25 -30 -25 -25 0 -30 4 -30 25 0 18 -5 25 -19 25 -12 0 -21 -9 -25 -25z"/>
                                <path class="logo-svg" d="M2397 1013 c-4 -3 -7 -16 -7 -29 0 -36 -11 -54 -31 -54 -14 0 -19 -7
-19 -25 0 -15 5 -24 13 -23 13 3 15 -42 3 -103 -5 -28 -13 -38 -30 -43 -18 -4
-23 -11 -19 -26 6 -24 17 -25 72 -5 22 8 41 11 41 7 0 -4 -12 -25 -26 -46 -19
-28 -23 -41 -15 -49 17 -17 42 2 73 59 16 27 28 41 28 31 0 -15 7 -18 32 -15
35 3 34 2 56 108 10 45 10 45 11 -25 l1 -71 -55 -35 c-51 -33 -54 -37 -41 -55
14 -18 16 -18 60 13 l46 32 15 -29 c22 -43 60 -41 82 4 17 37 12 66 -11 66 -7
0 -17 -10 -20 -22 -6 -21 -7 -22 -17 -5 -8 13 -3 32 21 80 36 74 43 120 18
125 -12 2 -20 -7 -27 -35 -20 -72 -33 -74 -26 -3 4 35 9 68 11 72 3 4 27 8 55
8 42 0 49 3 49 20 0 11 -4 20 -9 20 -5 0 -11 14 -15 31 -8 40 -41 37 -41 -4 1
-19 -4 -27 -16 -27 -15 0 -16 5 -9 30 8 28 7 30 -16 30 -19 0 -26 -6 -30 -30
-6 -30 -7 -30 -70 -30 -56 0 -64 -2 -64 -19 0 -14 -5 -18 -20 -14 -18 5 -20
11 -14 49 6 39 4 44 -13 44 -11 0 -23 -3 -26 -7z m193 -102 c0 -30 -14 -41
-51 -41 -39 0 -44 5 -33 34 7 17 84 23 84 7z m-141 -88 c-10 -62 -14 -70 -31
-65 -17 4 -18 11 -13 46 10 63 15 76 31 76 8 0 14 5 14 12 0 6 2 9 5 6 3 -3 0
-37 -6 -75z m76 -18 c-3 -14 -7 -36 -10 -50 -6 -29 -35 -34 -35 -6 0 48 13 81
31 81 15 0 18 -5 14 -25z"/>
                                <path class="logo-svg" d="M1562 1003 c-9 -3 -7 -12 8 -33 26 -36 25 -44 -5 -60 -49 -26 -15
-57 38 -35 14 6 17 2 17 -19 0 -26 -25 -56 -72 -84 -16 -9 -28 -22 -28 -29 0
-24 29 -25 61 -2 l32 23 -7 -34 c-10 -50 -33 -80 -61 -80 -20 0 -25 -5 -25
-24 0 -23 3 -24 38 -19 20 3 44 12 53 20 29 24 51 127 48 219 -3 74 -1 87 20
115 19 25 21 33 10 40 -21 13 -26 11 -43 -12 l-14 -21 -11 21 c-11 20 -32 25
-59 14z"/>
                                <path class="logo-svg" d="M1265 898 c-2 -13 -9 -47 -13 -75 -9 -50 -8 -53 12 -53 19 0 23 9 33
67 9 52 9 69 0 75 -19 12 -26 9 -32 -14z"/>
                                <path class="logo-svg"d="M1354 903 c-3 -10 -14 -37 -26 -60 -11 -23 -17 -46 -13 -52 12 -21
36 -11 52 24 16 34 17 34 87 37 58 2 71 6 74 21 3 15 -5 17 -62 17 -52 0 -66
3 -66 15 0 21 -39 19 -46 -2z"/>
                                <path class="logo-svg" d="M1180 886 c0 -7 -3 -34 -6 -60 -6 -42 -5 -46 14 -46 16 0 22 8 27 43
3 23 9 50 11 60 4 13 -1 17 -20 17 -15 0 -26 -6 -26 -14z"/>
                                <path class="logo-svg" d="M1676 763 c-10 -60 -20 -120 -23 -135 -5 -24 -2 -28 17 -28 14 0 24
8 27 20 5 19 12 21 72 18 51 -2 66 -6 66 -18 0 -8 9 -16 20 -18 19 -3 22 7 38
105 10 59 20 120 23 136 l6 27 -114 0 -114 0 -18 -107z m104 60 c-1 -27 -15
-53 -29 -53 -24 0 -29 7 -23 35 3 18 11 25 28 25 13 0 24 -3 24 -7z m90 0 c-1
-29 -15 -53 -31 -53 -14 0 -19 7 -19 30 0 25 4 30 25 30 14 0 25 -3 25 -7z
m-110 -118 c0 -20 -5 -25 -25 -25 -20 0 -25 5 -25 25 0 20 5 25 25 25 20 0 25
-5 25 -25z m90 0 c0 -20 -5 -25 -25 -25 -26 0 -29 7 -19 34 10 27 44 20 44 -9z"/>
                                <path class="logo-svg" d="M1393 814 c-3 -9 3 -21 16 -30 11 -8 21 -19 21 -25 0 -5 -57 -9 -134
-9 l-134 0 -6 -45 c-6 -39 -10 -45 -32 -45 -17 0 -24 -5 -24 -20 0 -19 7 -20
194 -20 168 0 195 2 200 16 9 23 8 24 -15 24 -18 0 -20 4 -13 45 5 39 4 45
-11 45 -17 0 -17 1 0 20 17 19 17 21 0 40 -22 24 -53 26 -62 4z m-153 -124 c0
-25 -4 -30 -24 -30 -19 0 -22 4 -19 24 3 14 13 27 22 29 9 3 17 5 19 6 1 0 2
-12 2 -29z m90 -2 c0 -23 -4 -28 -25 -28 -26 0 -28 3 -19 35 3 12 14 21 25 21
14 0 19 -7 19 -28z m90 12 c0 -22 -14 -40 -31 -40 -21 0 -24 12 -9 40 10 18
40 18 40 0z"/>
                                <path class="logo-svg" d="M1101 438 c-6 -35 -13 -82 -17 -105 l-7 -43 48 0 c90 0 151 55 110
100 -14 15 -14 18 0 30 18 15 20 51 3 68 -7 7 -38 12 -69 12 l-57 0 -11 -62z
m127 21 c5 -27 -26 -49 -70 -49 -37 0 -40 2 -34 23 3 12 6 28 6 35 0 21 94 12
98 -9z m-10 -98 c5 -32 -21 -51 -70 -51 -36 0 -38 1 -38 33 0 44 6 48 60 45
39 -3 45 -6 48 -27z"/>
                                <path class="logo-svg" d="M1300 498 c-1 -2 -7 -39 -15 -83 -17 -92 -18 -125 -7 -125 5 0 14 37
21 83 7 45 15 92 18 105 3 13 1 22 -6 22 -6 0 -11 -1 -11 -2z"/>
                                <path class="logo-svg" d="M2587 399 c-16 -92 -17 -122 -2 -107 6 6 35 164 35 191 0 9 -4 17 -8
17 -4 0 -16 -46 -25 -101z"/>
                                <path class="logo-svg" d="M2647 399 c-16 -91 -17 -122 -2 -108 6 7 35 158 35 187 0 12 -4 22
-8 22 -4 0 -16 -46 -25 -101z"/>
                                <path class="logo-svg" d="M2049 463 c-6 -16 -12 -59 -15 -96 -3 -54 -1 -69 12 -74 19 -7 32 6
15 16 -9 6 -10 20 -6 47 11 64 16 74 33 74 15 1 15 2 -1 11 -12 7 -16 17 -12
30 10 30 -14 22 -26 -8z"/>
                                <path class="logo-svg"d="M1519 421 c-26 -26 -30 -37 -27 -73 3 -36 7 -44 31 -52 32 -11 77 7
85 34 4 13 2 12 -14 -1 -39 -33 -84 -27 -84 11 0 18 7 20 55 20 63 0 75 12 53
57 -19 41 -60 43 -99 4z m81 -12 c15 -28 10 -31 -44 -27 -46 3 -46 3 -31 26
20 28 61 29 75 1z"/>
                                <path class="logo-svg" d="M1767 439 c-22 -13 -47 -61 -47 -92 0 -28 28 -57 56 -57 23 0 69 39
58 49 -4 3 -9 0 -11 -7 -15 -42 -83 -32 -83 13 0 63 57 109 86 70 17 -23 32
-11 18 13 -13 20 -52 26 -77 11z"/>
                                <path class="logo-svg" d="M1899 431 c-13 -11 -20 -23 -16 -28 5 -4 13 0 18 10 6 10 22 17 40
17 26 0 30 -3 27 -22 -2 -18 -12 -24 -41 -29 -50 -8 -72 -30 -63 -63 7 -28 27
-33 70 -16 17 6 26 6 26 0 0 -6 6 -10 13 -10 16 0 21 128 5 147 -15 19 -52 16
-79 -6z m61 -80 c0 -23 -17 -38 -50 -43 -21 -2 -25 1 -25 22 0 17 7 26 25 31
41 12 50 10 50 -10z"/>
                                <path class="logo-svg" d="M2235 440 c-4 -6 -15 -8 -24 -5 -15 4 -19 -5 -29 -59 -14 -77 -15
-86 -2 -86 5 0 12 23 16 51 7 56 34 92 62 87 19 -4 21 -26 9 -95 -11 -64 10
-53 23 12 12 59 33 88 59 83 17 -4 20 -35 9 -100 -4 -21 -3 -38 2 -38 12 0 30
66 30 112 0 43 -27 58 -66 37 -19 -10 -27 -10 -36 -1 -15 15 -45 16 -53 2z"/>
                                <path class="logo-svg" d="M2449 431 c-13 -11 -20 -23 -16 -28 5 -4 13 0 18 10 12 20 65 23 72
3 8 -19 -12 -36 -43 -36 -37 0 -70 -27 -70 -56 0 -31 24 -41 64 -26 20 8 32 9
34 2 2 -5 9 -10 15 -10 17 0 22 141 5 152 -22 13 -55 9 -79 -11z m61 -79 c0
-26 -20 -42 -53 -42 -24 0 -28 4 -25 22 3 21 17 28 71 37 4 0 7 -7 7 -17z"/>
                                <path class="logo-svg" d="M1346 423 c-14 -53 -17 -105 -6 -118 15 -18 52 -19 68 -3 10 10 15
10 22 -2 11 -17 15 -9 25 55 3 22 9 50 12 63 3 12 0 22 -5 22 -6 0 -16 -25
-22 -55 -8 -40 -18 -60 -36 -71 -33 -22 -57 -3 -49 38 3 15 8 42 11 58 6 32
-11 43 -20 13z"/>
                            </g>
                        </svg>

                    </a>
                </div><!-- /.logo -->
                <!-- ============================================================= LOGO : END ============================================================= -->		</div><!-- /.logo-holder -->

            <div class="col-xs-12 col-sm-12 col-md-6 top-search-holder no-margin">
                <div class="contact-row">
                    <div class="phone inline">
                        <i class="fa fa-phone"></i> (+86) 150 2859 9182
                    </div>
                    <div class="contact inline">
                        <i class="fa fa-envelope"></i> liangzhao2011@<span class="le-color">163.com</span>
                    </div>
                </div><!-- /.contact-row -->
                <!-- ============================================================= SEARCH AREA ============================================================= -->
                <div class="search-area">
                        <form id="f" action="<? echo yii\helpers\Url::to(['product/search']) ?>" method="post">
                        <div class="control-group">
                            <input name="title" class="search-field" placeholder="搜索" />

                            <ul class="categories-filter animate-dropdown">
                                <li class="dropdown">

                                    <input style="width: 140px;border: 0px" value="全部分类" name="cate" id="cate"   data-toggle="dropdown">
                                   <?php $cates = \common\models\Category::find()->all(); ?>
                                    <ul class="dropdown-menu" role="menu" >
                                        <?php foreach ($cates as $c): ?>
                                        <li role="presentation">
                                            <a title="<?php echo $c->title ?>" role="menuitem" onclick="$('#cate').attr('value',$(this).attr('title'))" tabindex="-1" ><?php echo $c->title ?></a>
                                        </li>
                                        <?php endforeach; ?>

                                    </ul>
                                </li>
                            </ul>

                            <a class="search-button" href="javascript:document.getElementById('f').submit()" ></a>

                        </div>
                        </form>
                </div><!-- /.search-area -->
                <!-- ============================================================= SEARCH AREA : END ============================================================= -->		</div><!-- /.top-search-holder -->

            <div class="col-xs-12 col-sm-12 col-md-3 top-cart-row no-margin">
                <div class="top-cart-row-container">
                    <div class="wishlist-compare-holder">
                        <div class="wishlist ">
                            <a href="#"><i class="fa fa-heart"></i> 收藏夹 <span class="value">(21)</span> </a>
                        </div>
                        <div class="compare">
                            <a href="#"><i class="fa fa-exchange"></i> compare <span class="value">(2)</span> </a>
                        </div>
                    </div>

                    <!-- ============================================================= SHOPPING CART DROPDOWN ============================================================= -->
	                <?php
	                $carts  = \common\models\Cart::find()->where([
		                'userid' => \Yii::$app->user->id])->asArray()->all();

	                $pr = 0;
	                $count = count($carts);
	                foreach ($carts as $c){
		                $pr +=$c['price']*$c['productnum'];

	                }
                    $cartps = \common\models\Cart::find()->joinWith('product')
                        ->where(['userid' => \Yii::$app->user->id])->all();
	                ?>
                    <div class="top-cart-holder dropdown animate-dropdown">

                        <div class="basket">

                            <a class="dropdown-toggle" data-toggle="dropdown" href="#">
                                <div class="basket-item-count">
                                    <span class="count"><? echo $count ?></span>
                                    <img src="/assets/images/icon-cart.png" alt="" />
                                </div>


                                <div class="total-price-basket">
                                    <span class="lbl">购物车:</span>
                                    <span class="total-price">
                        <span class="sign"></span><span class="value">￥<? echo number_format($pr,2);       ?></span>
                    </span>
                                </div>
                            </a>

                            <ul class="dropdown-menu">

                                <? foreach ($cartps as $p): ?>
                                <li>
                                    <div class="basket-item">
                                        <div class="row">
                                            <div class="col-xs-4 col-sm-4 no-margin text-center">
                                                <div class="thumb">
                                                    <img alt="" src="<? echo $p->product->cover ?>" />
                                                </div>
                                            </div>
                                            <div class="col-xs-8 col-sm-8 no-margin">
                                                <div class="title"><? echo mb_substr($p->product->title,0,6,'utf8') ?>..... X <? echo $p->productnum ?></div>
                                                <div class="price">￥<? echo number_format($p->price*$p->productnum,2) ?></div>
                                            </div>
                                        </div>
                                        <a class="close-btn" id="<? echo $p->id ?>" href="#"></a>
                                    </div>
                                </li>
                                <? endforeach; ?>



                                <li class="checkout">
                                    <div class="basket-item">
                                        <div class="row">
                                            <div class="col-xs-12 col-sm-6">
                                                <a href="<? echo \Yii::$app->user->isGuest ? yii\helpers\Url::to(['member/auth']) : yii\helpers\Url::to(['cart/index']); ?>" class="le-button inverse">进入购物车</a>
                                            </div>
                                            <div class="col-xs-12 col-sm-6">
                                                <a href=<? echo \Yii::$app->user->isGuest ? yii\helpers\Url::to(['member/auth']) : yii\helpers\Url::to(['order/check']); ?> class="le-button">结算</a>
                                            </div>
                                        </div>
                                    </div>
                                </li>

                            </ul>
                        </div><!-- /.basket -->
                    </div><!-- /.top-cart-holder -->
                </div><!-- /.top-cart-row-container -->
                <!-- ============================================================= SHOPPING CART DROPDOWN : END ============================================================= -->		</div><!-- /.top-cart-row -->

        </div><!-- /.container -->
    </header>
<?php echo $content;?>

		<footer id="footer" class="color-bg">

<!--			<div class="sub-form-row">-->
<!--				<div class="container">-->
<!--					<div class="col-xs-12 col-sm-8 col-sm-offset-2 no-padding">-->
<!--						<form role="form">-->
<!--							<input placeholder="Subscribe to our newsletter">-->
<!--							<button class="le-button">Subscribe</button>-->
<!--						</form>-->
<!--					</div>-->
<!--				</div><!-- /.container -->
<!--			</div><!-- /.sub-form-row -->

			<div class="link-list-row">
				<div class="container no-padding">
					<div class="col-xs-12 col-md-4 ">
						<!-- ============================================================= CONTACT INFO ============================================================= -->
						<div class="contact-info">
							<div class="footer-logo">
                                <svg version="1.0" xmlns="http://www.w3.org/2000/svg"
                                     width="289.000000pt" height="121.000000pt" viewBox="0 0 289.000000 121.000000"
                                     preserveAspectRatio="xMidYMid meet">
                                    <metadata>
                                        Created by potrace 1.13, written by Peter Selinger 2001-2015
                                    </metadata>
                                    <g transform="translate(0.000000,121.000000) scale(0.100000,-0.100000)"
                                       fill="#000000" stroke="none">
                                    <path d="M183 1083 c-14 -21 -19 -53 -22 -147 -3 -107 -6 -124 -28 -157 -48
-73 -66 -188 -43 -269 16 -55 61 -112 120 -152 66 -44 113 -59 205 -67 l70 -6
5 -50 5 -50 18 53 c16 46 22 52 47 52 24 0 29 -5 40 -45 18 -66 30 -65 30 3 0
57 1 60 28 67 46 11 134 58 193 102 79 59 136 127 173 203 55 117 38 258 -41
332 -17 16 -23 32 -23 63 0 44 -22 85 -46 85 -8 0 -26 -12 -40 -27 -24 -25
-26 -26 -75 -15 -115 27 -280 9 -390 -42 -61 -28 -69 -26 -122 33 -32 35 -66
61 -81 61 -3 0 -14 -12 -23 -27z m112 -208 c0 -47 -2 -85 -5 -85 -25 2 -60 57
-60 95 0 24 39 75 57 75 4 0 8 -38 8 -85z m80 60 c36 -35 35 -96 -1 -124 -38
-30 -42 -27 -31 23 7 30 7 57 0 85 -13 48 -3 52 32 16z m410 8 c-14 -35 -17
-92 -7 -122 13 -38 -1 -41 -35 -9 -32 30 -32 90 2 123 28 29 50 33 40 8z m83
-16 c31 -28 30 -80 -3 -112 -13 -14 -28 -25 -32 -25 -4 0 -8 38 -8 84 0 88 2
90 43 53z m-288 -41 c0 -8 -5 -18 -10 -21 -13 -8 -42 14 -34 26 9 15 44 10 44
-5z m-5 -78 c7 -17 18 -23 43 -23 17 0 32 -3 32 -7 0 -13 -65 -9 -78 4 -9 9
-15 9 -24 0 -13 -13 -78 -17 -78 -4 0 4 15 7 33 7 24 0 35 6 42 23 5 12 12 22
15 22 3 0 10 -10 15 -22z"/>
                                    <path d="M2138 1023 c-10 -2 -18 -11 -18 -19 0 -11 -17 -14 -80 -14 -73 0 -80
-2 -80 -20 0 -17 7 -20 45 -20 41 0 45 -2 45 -24 0 -20 -4 -23 -37 -22 l-37 1
-23 -139 c-23 -138 -24 -166 -3 -166 15 0 28 35 40 118 14 87 36 89 26 2 l-7
-57 85 0 84 0 9 56 c5 39 13 57 24 59 15 3 15 -4 5 -60 -9 -54 -14 -63 -34
-66 -23 -4 -32 -37 -10 -44 23 -8 67 5 72 21 13 42 46 264 41 270 -7 6 -13 8
-45 10 -18 1 -19 4 -10 21 8 15 21 20 55 20 38 0 45 3 45 20 0 18 -7 20 -80
20 -73 0 -80 2 -80 20 0 20 -2 21 -32 13z m40 -90 c-2 -12 -16 -20 -41 -24
-34 -5 -37 -4 -37 18 0 20 5 23 41 23 33 0 40 -3 37 -17z m-26 -86 c-16 -18
-15 -20 13 -43 l30 -24 -75 0 c-68 1 -73 2 -56 15 11 8 23 15 28 15 10 0 10
21 -1 38 -6 10 -15 9 -44 -8 -37 -22 -37 -22 -37 -2 0 26 10 29 92 28 64 -1
66 -2 50 -19z m83 12 c4 -5 4 -17 1 -25 -5 -13 -9 -13 -31 2 -14 9 -25 19 -25
23 0 11 49 11 55 0z m-85 -123 c0 -24 -17 -36 -51 -36 -32 0 -39 3 -39 20 0
17 7 20 45 20 25 0 45 -2 45 -4z"/>
                                    <path d="M1268 1009 c-2 -5 -27 -10 -56 -11 -44 0 -52 -3 -52 -19 0 -16 8 -19
50 -19 38 0 50 -4 50 -15 0 -8 9 -15 19 -15 10 0 21 7 25 15 3 10 19 15 46 15
29 0 40 -4 40 -15 0 -9 9 -15 25 -15 16 0 25 6 25 15 0 12 13 15 56 15 47 0
55 3 52 18 -3 13 -13 17 -51 16 -34 -1 -47 2 -47 12 0 18 -36 18 -43 0 -7 -18
-93 -16 -89 2 3 15 -45 16 -50 1z"/>
                                    <path d="M1756 995 c-5 -20 -13 -25 -36 -25 -23 0 -30 -4 -30 -20 0 -15 7 -20
25 -20 18 0 25 -5 25 -20 0 -14 7 -20 21 -20 12 0 23 8 26 20 4 14 14 20 35
20 25 0 29 -3 25 -20 -4 -16 0 -20 19 -20 17 0 24 6 24 19 0 14 8 21 27 23 38
4 45 38 9 38 -23 0 -26 3 -20 25 5 22 3 25 -20 25 -21 0 -26 -5 -26 -25 0 -21
-5 -25 -30 -25 -25 0 -30 4 -30 25 0 18 -5 25 -19 25 -12 0 -21 -9 -25 -25z"/>
                                    <path d="M2397 1013 c-4 -3 -7 -16 -7 -29 0 -36 -11 -54 -31 -54 -14 0 -19 -7
-19 -25 0 -15 5 -24 13 -23 13 3 15 -42 3 -103 -5 -28 -13 -38 -30 -43 -18 -4
-23 -11 -19 -26 6 -24 17 -25 72 -5 22 8 41 11 41 7 0 -4 -12 -25 -26 -46 -19
-28 -23 -41 -15 -49 17 -17 42 2 73 59 16 27 28 41 28 31 0 -15 7 -18 32 -15
35 3 34 2 56 108 10 45 10 45 11 -25 l1 -71 -55 -35 c-51 -33 -54 -37 -41 -55
14 -18 16 -18 60 13 l46 32 15 -29 c22 -43 60 -41 82 4 17 37 12 66 -11 66 -7
0 -17 -10 -20 -22 -6 -21 -7 -22 -17 -5 -8 13 -3 32 21 80 36 74 43 120 18
125 -12 2 -20 -7 -27 -35 -20 -72 -33 -74 -26 -3 4 35 9 68 11 72 3 4 27 8 55
8 42 0 49 3 49 20 0 11 -4 20 -9 20 -5 0 -11 14 -15 31 -8 40 -41 37 -41 -4 1
-19 -4 -27 -16 -27 -15 0 -16 5 -9 30 8 28 7 30 -16 30 -19 0 -26 -6 -30 -30
-6 -30 -7 -30 -70 -30 -56 0 -64 -2 -64 -19 0 -14 -5 -18 -20 -14 -18 5 -20
11 -14 49 6 39 4 44 -13 44 -11 0 -23 -3 -26 -7z m193 -102 c0 -30 -14 -41
-51 -41 -39 0 -44 5 -33 34 7 17 84 23 84 7z m-141 -88 c-10 -62 -14 -70 -31
-65 -17 4 -18 11 -13 46 10 63 15 76 31 76 8 0 14 5 14 12 0 6 2 9 5 6 3 -3 0
-37 -6 -75z m76 -18 c-3 -14 -7 -36 -10 -50 -6 -29 -35 -34 -35 -6 0 48 13 81
31 81 15 0 18 -5 14 -25z"/>
                                    <path d="M1562 1003 c-9 -3 -7 -12 8 -33 26 -36 25 -44 -5 -60 -49 -26 -15
-57 38 -35 14 6 17 2 17 -19 0 -26 -25 -56 -72 -84 -16 -9 -28 -22 -28 -29 0
-24 29 -25 61 -2 l32 23 -7 -34 c-10 -50 -33 -80 -61 -80 -20 0 -25 -5 -25
-24 0 -23 3 -24 38 -19 20 3 44 12 53 20 29 24 51 127 48 219 -3 74 -1 87 20
115 19 25 21 33 10 40 -21 13 -26 11 -43 -12 l-14 -21 -11 21 c-11 20 -32 25
-59 14z"/>
                                    <path d="M1265 898 c-2 -13 -9 -47 -13 -75 -9 -50 -8 -53 12 -53 19 0 23 9 33
67 9 52 9 69 0 75 -19 12 -26 9 -32 -14z"/>
                                    <path d="M1354 903 c-3 -10 -14 -37 -26 -60 -11 -23 -17 -46 -13 -52 12 -21
36 -11 52 24 16 34 17 34 87 37 58 2 71 6 74 21 3 15 -5 17 -62 17 -52 0 -66
3 -66 15 0 21 -39 19 -46 -2z"/>
                                    <path d="M1180 886 c0 -7 -3 -34 -6 -60 -6 -42 -5 -46 14 -46 16 0 22 8 27 43
3 23 9 50 11 60 4 13 -1 17 -20 17 -15 0 -26 -6 -26 -14z"/>
                                    <path d="M1676 763 c-10 -60 -20 -120 -23 -135 -5 -24 -2 -28 17 -28 14 0 24
8 27 20 5 19 12 21 72 18 51 -2 66 -6 66 -18 0 -8 9 -16 20 -18 19 -3 22 7 38
105 10 59 20 120 23 136 l6 27 -114 0 -114 0 -18 -107z m104 60 c-1 -27 -15
-53 -29 -53 -24 0 -29 7 -23 35 3 18 11 25 28 25 13 0 24 -3 24 -7z m90 0 c-1
-29 -15 -53 -31 -53 -14 0 -19 7 -19 30 0 25 4 30 25 30 14 0 25 -3 25 -7z
m-110 -118 c0 -20 -5 -25 -25 -25 -20 0 -25 5 -25 25 0 20 5 25 25 25 20 0 25
-5 25 -25z m90 0 c0 -20 -5 -25 -25 -25 -26 0 -29 7 -19 34 10 27 44 20 44 -9z"/>
                                    <path d="M1393 814 c-3 -9 3 -21 16 -30 11 -8 21 -19 21 -25 0 -5 -57 -9 -134
-9 l-134 0 -6 -45 c-6 -39 -10 -45 -32 -45 -17 0 -24 -5 -24 -20 0 -19 7 -20
194 -20 168 0 195 2 200 16 9 23 8 24 -15 24 -18 0 -20 4 -13 45 5 39 4 45
-11 45 -17 0 -17 1 0 20 17 19 17 21 0 40 -22 24 -53 26 -62 4z m-153 -124 c0
-25 -4 -30 -24 -30 -19 0 -22 4 -19 24 3 14 13 27 22 29 9 3 17 5 19 6 1 0 2
-12 2 -29z m90 -2 c0 -23 -4 -28 -25 -28 -26 0 -28 3 -19 35 3 12 14 21 25 21
14 0 19 -7 19 -28z m90 12 c0 -22 -14 -40 -31 -40 -21 0 -24 12 -9 40 10 18
40 18 40 0z"/>
                                    <path d="M1101 438 c-6 -35 -13 -82 -17 -105 l-7 -43 48 0 c90 0 151 55 110
100 -14 15 -14 18 0 30 18 15 20 51 3 68 -7 7 -38 12 -69 12 l-57 0 -11 -62z
m127 21 c5 -27 -26 -49 -70 -49 -37 0 -40 2 -34 23 3 12 6 28 6 35 0 21 94 12
98 -9z m-10 -98 c5 -32 -21 -51 -70 -51 -36 0 -38 1 -38 33 0 44 6 48 60 45
39 -3 45 -6 48 -27z"/>
                                    <path d="M1300 498 c-1 -2 -7 -39 -15 -83 -17 -92 -18 -125 -7 -125 5 0 14 37
21 83 7 45 15 92 18 105 3 13 1 22 -6 22 -6 0 -11 -1 -11 -2z"/>
                                    <path d="M2587 399 c-16 -92 -17 -122 -2 -107 6 6 35 164 35 191 0 9 -4 17 -8
17 -4 0 -16 -46 -25 -101z"/>
                                    <path d="M2647 399 c-16 -91 -17 -122 -2 -108 6 7 35 158 35 187 0 12 -4 22
-8 22 -4 0 -16 -46 -25 -101z"/>
                                    <path d="M2049 463 c-6 -16 -12 -59 -15 -96 -3 -54 -1 -69 12 -74 19 -7 32 6
15 16 -9 6 -10 20 -6 47 11 64 16 74 33 74 15 1 15 2 -1 11 -12 7 -16 17 -12
30 10 30 -14 22 -26 -8z"/>
                                    <path d="M1519 421 c-26 -26 -30 -37 -27 -73 3 -36 7 -44 31 -52 32 -11 77 7
85 34 4 13 2 12 -14 -1 -39 -33 -84 -27 -84 11 0 18 7 20 55 20 63 0 75 12 53
57 -19 41 -60 43 -99 4z m81 -12 c15 -28 10 -31 -44 -27 -46 3 -46 3 -31 26
20 28 61 29 75 1z"/>
                                    <path d="M1767 439 c-22 -13 -47 -61 -47 -92 0 -28 28 -57 56 -57 23 0 69 39
58 49 -4 3 -9 0 -11 -7 -15 -42 -83 -32 -83 13 0 63 57 109 86 70 17 -23 32
-11 18 13 -13 20 -52 26 -77 11z"/>
                                    <path d="M1899 431 c-13 -11 -20 -23 -16 -28 5 -4 13 0 18 10 6 10 22 17 40
17 26 0 30 -3 27 -22 -2 -18 -12 -24 -41 -29 -50 -8 -72 -30 -63 -63 7 -28 27
-33 70 -16 17 6 26 6 26 0 0 -6 6 -10 13 -10 16 0 21 128 5 147 -15 19 -52 16
-79 -6z m61 -80 c0 -23 -17 -38 -50 -43 -21 -2 -25 1 -25 22 0 17 7 26 25 31
41 12 50 10 50 -10z"/>
                                    <path d="M2235 440 c-4 -6 -15 -8 -24 -5 -15 4 -19 -5 -29 -59 -14 -77 -15
-86 -2 -86 5 0 12 23 16 51 7 56 34 92 62 87 19 -4 21 -26 9 -95 -11 -64 10
-53 23 12 12 59 33 88 59 83 17 -4 20 -35 9 -100 -4 -21 -3 -38 2 -38 12 0 30
66 30 112 0 43 -27 58 -66 37 -19 -10 -27 -10 -36 -1 -15 15 -45 16 -53 2z"/>
                                    <path d="M2449 431 c-13 -11 -20 -23 -16 -28 5 -4 13 0 18 10 12 20 65 23 72
3 8 -19 -12 -36 -43 -36 -37 0 -70 -27 -70 -56 0 -31 24 -41 64 -26 20 8 32 9
34 2 2 -5 9 -10 15 -10 17 0 22 141 5 152 -22 13 -55 9 -79 -11z m61 -79 c0
-26 -20 -42 -53 -42 -24 0 -28 4 -25 22 3 21 17 28 71 37 4 0 7 -7 7 -17z"/>
                                    <path d="M1346 423 c-14 -53 -17 -105 -6 -118 15 -18 52 -19 68 -3 10 10 15
10 22 -2 11 -17 15 -9 25 55 3 22 9 50 12 63 3 12 0 22 -5 22 -6 0 -16 -25
-22 -55 -8 -40 -18 -60 -36 -71 -33 -22 -57 -3 -49 38 3 15 8 42 11 58 6 32
-11 43 -20 13z"/>

                                </svg>
							</div><!-- /.footer-logo -->

							<p class="regular-bold"> 免费电话联系我们,或者给我们发邮件。</p>

							<p>
								liangzhao2011@163.com
								1-888-8MEDIA (1-888-892-9953)
							</p>

							<div class="social-icons">
								<h3>联系我们</h3>
								<ul>
									<li><a href="http://facebook.com/transvelo" class="fa fa-qq"></a></li>
									<li><a href="#" class="fa fa-wechat"></a></li>
									<li><a href="#" class="fa fa-weibo"></a></li>
								</ul>
							</div><!-- /.social-icons -->

						</div>
						<!-- ============================================================= CONTACT INFO : END ============================================================= -->            </div>

					<div class="col-xs-12 col-md-8 no-margin">
						<!-- ============================================================= LINKS FOOTER ============================================================= -->
						<div class="link-widget">
							<div class="widget">
								<h3>配送与支付</h3>
								<ul>
									<li><a href="#">上门自提</a></li>
									<li><a href="#">支付方式说明</a></li>
									<li><a href="#">快递智能查询</a></li>
								</ul>
							</div><!-- /.widget -->
						</div><!-- /.link-widget -->

						<div class="link-widget">
							<div class="widget">
								<h3>服务保证</h3>
								<ul>
									<li><a href="#">产品质量保证</a></li>
									<li><a href="#">售后服务保证</a></li>

								</ul>
							</div><!-- /.widget -->
						</div><!-- /.link-widget -->

						<div class="link-widget">
							<div class="widget">
								<h3>会员中心</h3>
								<ul>
									<li><a href="#">我的订单</a></li>
									<li><a href="#">我的收藏</a></li>
									<li><a href="#">资金管理</a></li>
								</ul>
							</div><!-- /.widget -->
						</div><!-- /.link-widget -->
						<!-- ============================================================= LINKS FOOTER : END ============================================================= -->            </div>
				</div><!-- /.container -->
			</div><!-- /.link-list-row -->

			<div class="copyright-bar">
				<div class="container">
					<div class="col-xs-12 col-sm-6 no-margin">
						<div class="copyright">
							&copy; <a href="index.html">蓝猫商城</a> - 冀ICP 20150325125
						</div><!-- /.copyright -->
					</div>
					<div class="col-xs-12 col-sm-6 no-margin">
						<div class="payment-methods ">
							<ul>
								<li><img alt="" src="/assets/images/payments/payment-zfb.jpg"></li>
								<li><img alt="" src="/assets/images/payments/payment-wx.jpg"></li>
								<li><img alt="" src="/assets/images/payments/payment-paypal.png"></li>
								<li><img alt="" src="/assets/images/payments/payment-skrill.png"></li>
							</ul>
						</div><!-- /.payment-methods -->
					</div>
				</div><!-- /.container -->
			</div><!-- /.copyright-bar -->

		</footer><!-- /#footer -->
		<!-- ============================================================= FOOTER : END ============================================================= -->	</div><!-- /.wrapper -->

<?php $this->endBody(); ?>

<script>
    $(document).ready(function(){
        $('.show-theme-options').click(function(){
            $(this).parent().toggleClass('open');
            return false;
        });
    });

    $(window).bind("load", function() {
        $('.show-theme-options').delay(2000).trigger('click');
    });
</script>
<script type="text/javascript">
    $(".close-btn").on('click',function(){

    swal({
        title: "你确要删除吗?",
        //text: "Once deleted, you will not be able to recover this imaginary file!",
        icon: "warning",
        buttons: ["返回", "确定"],
        dangerMode: true,
    })
        .then((willDelete) => {
            if (willDelete) {
                var id = $(this).attr('id');
                var url = "<?php echo yii\helpers\Url::to(['cart/del']); ?>";
                $.ajax({
                    url : url,
                    async: false,
                    type : "post",
                    //data : {ids:JSON.stringify(ids)},
                    data : {
                        id:id,
                    },
                    dataType : "json",
                    success : function(res) {
                        //alert(res);

                        if (res.status == 1) {
                            location.reload();
                        }else if(res.status ==0){
                            swal({title: res.msg, icon: "error"});
                            //console.log(res.msg);
                            //layer.alert(res.msg, {icon: 2});
                            //layer.msg('添加失败!',{icon:1,time:1000});
                        }else if(res.status==2){
                            swal({title: res.msg, icon: "error"});
                        }else if(res.status==3){
                            swal({title: res.msg, icon: "error"});
                        }else{
                            layer.alert(res.msg, {icon: 2});
                        }
                    }

                });
            }
        });

});
</script>
<script src="http://w.sharethis.com/button/buttons.js"></script>
</body>
</html>
<?php $this->endPage(); ?>
